app/controllers/plants_controller.rb

  def create
    params['plant']['location'] = params['location']
    params['plant']['size'] = params['size']
    @resource = Plant.new(resource_params)
    respond_to do |format|
      if @resource.save
---
INSERT INTO "plants" ("common_name", "latin_name", "image", "location", "uses", "cautions") VALUES (?, ?, ?, ?, ?, ?)  [["common_name", "blueberry"], ["latin_name", ""], ["image", ""], ["location", "wetlands"], ["uses", ""], ["cautions", ""]]

  def index
    @collection = Plant.all
---
SELECT "plants".* FROM "plants"

  def show
    @resource = Plant.find(params['id'])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @resource = Plant.find(params['id'])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT 1  [["id", 1]]

  def update
    params['plant']['location'] = params['location']
    params['plant']['size'] = params['size']
    @resource = Plant.find(params['id'])
    respond_to do |format|
      if @resource.update(resource_params)
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "plants" SET "latin_name" = ?, "uses" = ?, "cautions" = ?, "size" = ? WHERE "plants"."id" = ?  [["latin_name", "bluesensin"], ["uses", "eating"], ["cautions", "don't eat too many"], ["size", "tree"], ["id", 1]]